/datum/economic_region/kingsfield
	name = "Кингсфилд"
	subtitle = "Бастион суверенитета Азурии"
	description = "Кингсфилд — город-крепость, расположенный на побережье к югу от Сумеречной Оси. Город обнесён мощными крепостными стенами и имеет в своем распоряжении небольшую батарею пороховой артиллерии, импортированной из Грензельхофта и способной простреливать всю акваторию Лазурного бассейна, тем самым защищая Герцогство от военного вторжения с моря. Здесь же находится главный морской порт Герцогства, в который регулярно прибывают беженцы, искатели приключений и другие чужеземцы, а также располагается основной контингент лейб-гвардии, обеспечивающей безопасность проходящего по побережью тракта, по сути являющегося единственной сухопутной дорогой, связывающей Азурийскую долину с остальным миром."

/datum/economic_region/rosawood
	name = "Розавуд"
	subtitle = "Эльфийский анклав, Лес Холодного побережья"
	description = "Последний вассал Азурии, которым всё ещё правит эльфийский лорд, и где эльфы составляют большинство населения. Расположен к северу от Безголовой Горы и граничит с узкой полосой бесплодных прибрежных лесов, известных как Южный Розавуд. Доступ сюда в основном осуществляется по морю. Лес экспортируется с южной окраины. В графстве необычно, почти магически холодно, а вегетационный период длится едва ли три месяца в году. Жители кормятся урожаем, собранным за эти три месяца, дополняя его рыбой из северного моря. Сухопутный путь через перевалы у подножия Безголовой Горы проходим, но медленен и опасен из-за разбойников «Черного Дуба». Сами эльфы предпочитают, чтобы так оно и оставалось. Поговаривают, что прекрасные белые плащи графа Розавуда сотканы так же, как и плащи наемников Черного Дуба, которых Корона едва терпит. Граф всегда поспешно отрицает любые обвинения в сговоре, и Корона так и не нашла доказательств обратного."

/datum/economic_region/rockhill
	name = "Генава"
	subtitle = "Сады, Виноделы и Травники Азурии"
	description = "Скопление садов и аптекарских огородов к северу от Сумеречной Оси, укрытое горным хребтом, который делает климат здесь гораздо мягче, чем он мог бы быть. Холмистая местность графства плохо подходит для зерна, но идеальна для плодовых деревьев. Вина и настойки Генавы славятся по всей Азурии. Это тихое, причудливое сельскохозяйственное графство, усеянное дворянскими поместьями. Яблочный бренди Генавы — самый подделываемый напиток в королевстве. Каждая вторая таверна от Мрачного побережья до Кингсфилда утверждает, что подает его, но, пожалуй, лишь треть говорит правду. Графство также известно своими богатыми усадьбами: почти три четверти благородных домов герцогства владеют здесь хотя бы одним поместьем."

/datum/economic_region/daftsmarch
	name = "Дафтсмарч"
	subtitle = "Шахтерская Марка, Руды Безголовой Горы"
	description = "Графство Дафтсмарч — сердце горнодобывающей промышленности Азурии, длинная полоса земли, прилегающая к южному подножию Безголовой Горы. Здесь добывается большая часть сырой руды и соли, от которых зависит благополучие герцогства. Работа оплачивается хорошо, а жилы изобильны. Но Дафтсмарч расположен неуютно близко к руинам Тарихеи и различным обитателям Подземелья. Опасность, исходящая от дроу и им подобных — постоянная угроза; многие из них видят в Дафтсмарче удобный источник рабов. Но рудные жилы здесь слишком богаты, и Корона не желает их бросать, посылая авантюристов, наемников и гарнизон на битву с обитателями Подземелья, чтобы держать последних в страхе."

/datum/economic_region/blackholt
	name = "Блэкхолт"
	subtitle = "Край Болот, Домен Охотничьего Маршала"
	description = "Поселение на южной окраине Болот ужаса, часть Герцогского Домена. Это единственное место, которое Герцог никогда не посещает лично, поручая управление доверенному придворному — Охотничьему Маршалу Блэкхолта. Поселение раскинулось между самим болотом и неосушенными топями на его краю. Местные научились выживать за счет необычных, а по слухам — благословленных Дендором даров болота: шелка местных мотыльков, потрохов болотных тварей и редкой Эссенции Дендора, за которую травники и маги платят баснословные деньги. Блэкхолт — мрачное и функциональное место. Туда не переезжают добровольно. Там просто оказываются."

/datum/economic_region/saltwick
	name = "Солтвик"
	subtitle = "Прибрежный город, Рыбные промыслы Королевства"
	description = "Поселение к юго-востоку от Сумеречной Оси, примерно в дне езды. Расположенный на побережье, город был основан сначала выходцами из Хаммерхолда, а позже — переселенцами из южного Гронна. Город резко разделен на две части: коптильни и соляные фермы, принадлежащие в основном северным эльфам, в то время как потомки гроннцев составляют большинство рыбаков и моряков. Эти две группы редко вступают в браки и часто спорят, но живут в одном городе в относительной гармонии. Конечно, здесь обитают не только они — в Солтвике много тех, кому не повезло в жизни, или кто просто ищет работу. Соль ввозится из Дафтсмарча, используется для консервации рыбы, пойманной местными рыбаками, а затем экспортируется по всей Азурии и Гримории."

/datum/economic_region/bleakcoast
	name = "Мрачное побережье"
	subtitle = "Морская марка Мрачных островов, Пиратский архипелаг"
	description = "Также известен как Морская марка Мрачных островов. Гряда скалистых выступов к северо-востоку от Сумеречной Оси. Архипелаг насчитывает десятки островов, что делает навигацию вдоль побережья Азурии чрезвычайно опасной. То, чего островам не хватает в плодородии, они восполняют дарами моря. Косяки рыб в скалистых мелководьях кормят тысячи людей. Но наслаждаться этими богатствами жителям островов не суждено. Архипелаг кишит пиратами — печально известными Налетчиками Мрачных островов, которые охотятся на любого торговца или рыбака, рискнувшего отойти далеко от берега. Герцогство содержит здесь несколько гарнизонов, а раз в два поколения предпринимает разорение островов, сжигая и засыпая солью каждое невоенное поселение. Безрезультатно. Через поколение пираты всегда возвращаются, ибо торговля здесь прибыльна, а пиратство — еще прибыльнее."

/datum/economic_region/northfort
	name = "Нортфорт"
	subtitle = "Пограничный форт, Стража Северного пути"
	description = "Укрепленный замок в северных болотах Азурийской долины. Настолько экономически бесполезен, насколько может быть бесполезен форт — то есть абсолютно. Корона кормит его только потому, что без него граница между Гренцельхофтом и Азурией станет предметом для обсуждения."

/datum/economic_region/heartfelt
	name = "Лазурный Анклав"
	subtitle = "Защитник запада, Щит против Тьмы"
	description = "Расположенный в западных районах Азурийской долины, замок Лазурного Анклава служит главным оплотом закона и порядка в этих отдаленных, малонаселенных землях. Главная функция замка заключается не столько в защите западной границы, которая и без того достаточно эффективно защищена непроходимыми горами и болотами, сколько в том, что Лазурный Анклав часто служит убежищем для жителей близлежащих деревень во время набегов бандитов, вторжений волколаков и атак вампиров. Помимо защиты замка, гарнизон Анклава также выполняет задачу сопровождения торговых и снабженческих караванов, которые перемещаются между западными регионами и городом Сумеречная Ось."

/datum/economic_region/hagenwald
	name = "Хагенвальд"
	subtitle = "Промышленное сердце, Кузни Копписового леса"
	description = "Промышленное сердце Азурии, расположенное на северном склоне Безголовой Горы. Сюда на мулах доставляют руду из Дафтсмарча для плавки и ковки. Хагенвальд производит почти каждый слиток железа, стали, меди и олова, используемый в герцогстве — без его печей кузнецы Азурии были бы вынуждены работать с ломом. Богатство города построено на лесах, окружающих его с трех сторон: лес вырубают и восстанавливают поколениями, чтобы огонь в печах никогда не гас. Половина рабочих — выходцы из Гренцельхофта, привлеченные высокими заработками, а улицы здесь вечно серы от сажи. Корона держит здесь небольшой гарнизон."
